; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v11)
             (pred_1 ?v5 ?v4)
             (pred_2 ?v10 ?v4)
             (pred_11 ?v7 ?v10 )
	     (pred_9 ?v10)
             (pred_10 ?v8)
             (pred_6 ?v5)
             (pred_3 ?v4)
             (pred_8 ?v10)
             (pred_12 ?v5)
             (pred_5 ?v10)
             (pred_7 ))



(:action op_3
:parameters (?v2 ?v12 ?v13 ?v9)
:precondition (and (pred_10 ?v2) (pred_10 ?v12) (pred_6 ?v13) (pred_3 ?v9)
          (pred_4 ?v2 ?v12) (pred_1 ?v13 ?v9)
                   (pred_2 ?v12 ?v9) (pred_9 ?v2) 
                   (pred_8 ?v12) (pred_12 ?v13))
:effect (and  (pred_5 ?v12) (not (pred_8 ?v12))))


(:action op_5
:parameters (?v2 ?v1)
:precondition (and (pred_10 ?v2) (pred_10 ?v1)
               (pred_9 ?v2) (pred_4 ?v2 ?v1) (pred_5 ?v1))
:effect (and (pred_9 ?v1) (not (pred_9 ?v2))))

(:action op_2
:parameters (?v2 ?v13)
:precondition (and (pred_10 ?v2) (pred_6 ?v13) 
                  (pred_9 ?v2) (pred_11 ?v13 ?v2) (pred_7 ))
:effect (and (pred_12 ?v13)
   (not (pred_11 ?v13 ?v2)) (not (pred_7 ))))


(:action op_4
:parameters (?v2 ?v3 ?v6)
:precondition (and (pred_10 ?v2) (pred_6 ?v3) (pred_6 ?v6)
                  (pred_9 ?v2) (pred_12 ?v6) (pred_11 ?v3 ?v2))
:effect (and (pred_12 ?v3) (pred_11 ?v6 ?v2)
        (not (pred_12 ?v6)) (not (pred_11 ?v3 ?v2))))

(:action op_1
:parameters (?v2 ?v13)
:precondition (and (pred_10 ?v2) (pred_6 ?v13) 
                  (pred_9 ?v2) (pred_12 ?v13))
:effect (and (pred_7 ) (pred_11 ?v13 ?v2) (not (pred_12 ?v13)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_20 obj_13 obj_21 obj_22 obj_12 obj_06 obj_18 obj_14 obj_04 obj_08 obj_16 obj_19 obj_01 obj_02 obj_03
    obj_15 obj_09 obj_11
    obj_05 obj_10 obj_07
    )

    (:init
       (pred_7)

       (pred_10 obj_17)
       (pred_10 obj_20)
       (pred_10 obj_13)
       (pred_10 obj_21)
       (pred_10 obj_22)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_18)
       (pred_10 obj_14)
       (pred_10 obj_04)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_09)
       (pred_3 obj_11)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_07)

       (pred_4 obj_17 obj_22)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_21)
       (pred_4 obj_13 obj_20)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_21 obj_13)
       (pred_4 obj_22 obj_14)
       (pred_4 obj_22 obj_12)
       (pred_4 obj_22 obj_17)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_22)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_14 obj_04)
       (pred_4 obj_14 obj_22)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_04 obj_14)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_02 obj_03)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_03 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_02)
       (pred_8 obj_03)
       (pred_2  obj_18 obj_15)
       (pred_2  obj_02 obj_09)
       (pred_2  obj_03 obj_11)
       (pred_5 obj_17)
       (pred_5 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_21)
       (pred_5 obj_22)
       (pred_5 obj_12)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_08)
       (pred_5 obj_16)
       (pred_5 obj_19)
       (pred_5 obj_01)

       (pred_1  obj_05 obj_15)
       (pred_1  obj_10 obj_09)
       (pred_1  obj_07 obj_11)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_07 obj_16)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_11 obj_05 obj_22)
       (pred_11 obj_07 obj_08)
    ))
(:constraints
  (always (not (pred_9 obj_04)))
)
)

; plan
1. (op_5 obj_01 obj_19)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_14)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_14)
   goals met: 0 of 2
3. (op_5 obj_14 obj_22)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_22)
   goals met: 0 of 2
4. (op_5 obj_22 obj_12)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_12)
   goals met: 0 of 2
5. (op_5 obj_12 obj_20)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_20)
   goals met: 0 of 2
6. (op_2 obj_20 obj_05)
   deleted: (pred_11 obj_05 obj_20) (pred_7)
   added: (pred_12 obj_05)
   goals met: 0 of 2
7. (op_5 obj_20 obj_12)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_12)
   goals met: 0 of 2
8. (op_5 obj_12 obj_22)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_22)
   goals met: 0 of 2
9. (op_1 obj_22 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_7) (pred_11 obj_05 obj_22)
   goals met: 1 of 2
10. (op_5 obj_22 obj_12)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_12)
   goals met: 1 of 2
11. (op_5 obj_12 obj_06)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_06)
   goals met: 1 of 2
12. (op_5 obj_06 obj_08)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_08)
   goals met: 1 of 2
13. (op_5 obj_08 obj_16)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_16)
   goals met: 1 of 2
14. (op_2 obj_16 obj_07)
   deleted: (pred_11 obj_07 obj_16) (pred_7)
   added: (pred_12 obj_07)
   goals met: 1 of 2
15. (op_5 obj_16 obj_08)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_08)
   goals met: 1 of 2
16. (op_1 obj_08 obj_07)
   deleted: (pred_12 obj_07)
   added: (pred_7) (pred_11 obj_07 obj_08)
   goals met: 2 of 2
